In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## 5.1.1 Series

In [3]:
ser = Series([4,7,-5,3])
ser

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
ser.values

array([ 4,  7, -5,  3])

In [5]:
ser.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [6]:
ser2 = Series([4,7,-5,3], index=['d','b','a','c'])
ser2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
ser2['a']

-5

In [8]:
ser2[2]

-5

In [9]:
ser2['d'] = 6

In [10]:
ser2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [11]:
ser2[ ser2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
'b' in ser2

True

In [13]:
ser3 = Series( {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000})
ser3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [36]:
state = ['California', 'Ohio','Oregon','Texas']
ser4 = Series({'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}, index=state)
ser4
# NaN = Not a Number

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [15]:
pd.isnull(ser4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [16]:
pd.notnull(ser4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [17]:
ser4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [79]:
ser4[-ser4.isnull()]

Ohio      35000
Oregon    16000
Texas     71000
dtype: float64

In [19]:
ser3 + ser4

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [20]:
ser4.name = 'population'
ser4.index.name = 'state'
ser4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [21]:
ser4.index = ['CA', 'OH', 'OR', 'TX']
ser4

CA      NaN
OH    35000
OR    16000
TX    71000
Name: population, dtype: float64

### 5.1.2 DataFrame

In [23]:
data = { 'state' : [ 'Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year' : [2000,2001,2002,2001,2002],
       'pop' : [1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [24]:
DataFrame(data, columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [25]:
frame2 = DataFrame(data, columns=['year', 'state','pop','debt'], index= ['one', 'two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [26]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [27]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [28]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [29]:
frame2.ix[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [30]:
type(frame2.year)

pandas.core.series.Series

In [31]:
type(frame2.ix[2])

pandas.core.series.Series

In [32]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [33]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5  16.5    True
two    2001    Ohio  1.7  16.5    True
three  2002    Ohio  3.6  16.5    True
four   2001  Nevada  2.4  16.5   False
five   2002  Nevada  2.9  16.5   False

In [34]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [37]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [38]:
'state' in frame2.columns

True

In [39]:
'two' in frame2.index

True

In [40]:
frame2.T

        one   two three    four    five
year   2000  2001  2002    2001    2002
state  Ohio  Ohio  Ohio  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9
debt   16.5  16.5  16.5    16.5    16.5

In [41]:
frame2.values

array([[2000, 'Ohio', 1.5, 16.5],
       [2001, 'Ohio', 1.7, 16.5],
       [2002, 'Ohio', 3.6, 16.5],
       [2001, 'Nevada', 2.4, 16.5],
       [2002, 'Nevada', 2.9, 16.5]], dtype=object)

### 5.2.1 Reindex

In [42]:
ser2

d    6
b    7
a   -5
c    3
dtype: int64

In [43]:
ser2.reindex(['a','b','c','d','e'])

a    -5
b     7
c     3
d     6
e   NaN
dtype: float64

In [44]:
ser2.reindex(['a','b','c','d','e'], fill_value=0)

a   -5
b    7
c    3
d    6
e    0
dtype: int64

In [45]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [46]:
frame.reindex(columns=['state','year','pop','debt'])

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
3  Nevada  2001  2.4   NaN
4  Nevada  2002  2.9   NaN

In [47]:
frame.reindex(columns=['state','year','pop','debt'], index=[1,2,4,3,0])

    state  year  pop  debt
1    Ohio  2001  1.7   NaN
2    Ohio  2002  3.6   NaN
4  Nevada  2002  2.9   NaN
3  Nevada  2001  2.4   NaN
0    Ohio  2000  1.5   NaN

In [48]:
frame.ix[[2,3], ['year','pop']]

   year  pop
2  2002  3.6
3  2001  2.4

### DataFrame 연산

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [50]:
frame2.drop('two')

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [51]:
frame2.drop('debt',axis=1)

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [53]:
frame2.ix[frame2.year > 2001]

       year   state  pop  debt
three  2002    Ohio  3.6  16.5
five   2002  Nevada  2.9  16.5

In [54]:
frame2.ix[frame2.year > 2001, 1:]

        state  pop  debt
three    Ohio  3.6  16.5
five   Nevada  2.9  16.5

In [55]:
frame2 + frame2

       year         state  pop  debt
one    4000      OhioOhio  3.0    33
two    4002      OhioOhio  3.4    33
three  4004      OhioOhio  7.2    33
four   4002  NevadaNevada  4.8    33
five   4004  NevadaNevada  5.8    33

In [56]:
frame3 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('abc'),
                   index=['Utah','Ohio','Texas','Oregon'])
frame3

        a   b   c
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [57]:
series = frame3.ix[0]
series

a    0
b    1
c    2
Name: Utah, dtype: float64

In [58]:
frame3 - series

        a  b  c
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

### 함수 적용

In [81]:
frame3

        a   b   c
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [59]:
np.mean(frame3)

a    4.5
b    5.5
c    6.5
dtype: float64

In [95]:
np.mean([1,2,3])

2.0

In [60]:
frame3.mean(skipna=False)

a    4.5
b    5.5
c    6.5
dtype: float64

In [61]:
frame3.sum()

a    18
b    22
c    26
dtype: float64

In [62]:
frame3.sum(axis=1)

Utah       3
Ohio      12
Texas     21
Oregon    30
dtype: float64

In [96]:
f = lambda x: x.max() - x.min()
frame3.apply(f)
# p574

a    9
b    9
c    9
dtype: float64

In [64]:
frame3.apply(f, axis=1)

Utah      2
Ohio      2
Texas     2
Oregon    2
dtype: float64

In [65]:
def f(x):
    return Series([x.min(),x.max()], index=['min','max'])

In [66]:
frame3.apply(f)

     a   b   c
min  0   1   2
max  9  10  11

In [67]:
def g(x):
    print(x)
    return len(x)

In [68]:
frame3.apply(g)

Utah      0
Ohio      3
Texas     6
Oregon    9
Name: a, dtype: float64
Utah       1
Ohio       4
Texas      7
Oregon    10
Name: b, dtype: float64
Utah       2
Ohio       5
Texas      8
Oregon    11
Name: c, dtype: float64

a    4
b    4
c    4
dtype: int64

In [69]:
divf = lambda x: x / 2
frame3.applymap(divf)

          a    b    c
Utah    0.0  0.5  1.0
Ohio    1.5  2.0  2.5
Texas   3.0  3.5  4.0
Oregon  4.5  5.0  5.5

### 정렬

In [70]:
frame3.sort_index()

        a   b   c
Ohio    3   4   5
Oregon  9  10  11
Texas   6   7   8
Utah    0   1   2

In [71]:
frame3.sort_index(axis=1, ascending=False)

         c   b  a
Utah     2   1  0
Ohio     5   4  3
Texas    8   7  6
Oregon  11  10  9

In [72]:
frame3.c.order(ascending=False)

Oregon    11
Texas      8
Ohio       5
Utah       2
Name: c, dtype: float64

In [73]:
frame3.sort_index(by=['a','b'])

        a   b   c
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [74]:
frame3.a.rank()

Utah      1
Ohio      2
Texas     3
Oregon    4
Name: a, dtype: float64

In [75]:
frame3.rank(axis=1)

        a  b  c
Utah    1  2  3
Ohio    1  2  3
Texas   1  2  3
Oregon  1  2  3

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = { 'state' : [ 'Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year' : [2000,2001,2002,2001,2002],
       'pop' : [1.5,1.7,3.6,2.4,2.9]}
frame2 = DataFrame(data, columns=['year', 'state','pop','debt'], index= ['one', 'two','three','four','five'])
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [3]:
# 누락된 데이터 처리
frame2.ix['one',['debt','pop']] = np.nan
frame2

       year   state  pop  debt
one    2000    Ohio  NaN   NaN
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [4]:
frame2.dropna()

       year   state  pop  debt
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [5]:
frame2.fillna(0)

       year   state  pop  debt
one    2000    Ohio  0.0   0.0
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [6]:
# 계층적색인
frame4 = DataFrame(np.arange(12).reshape((4,3)),
                   index=[['a','a','b','b'], [1,2,1,2]],
                   columns=[['Ohio','Ohio','Colorado'], ['G','R','G']])
frame4

    Ohio     Colorado
       G   R        G
a 1    0   1        2
  2    3   4        5
b 1    6   7        8
  2    9  10       11

In [7]:
frame4.index.names=['key1','key2']
frame4.columns.names=['state','color']
frame4

state     Ohio     Colorado
color        G   R        G
key1 key2
a    1       0   1        2
     2       3   4        5
b    1       6   7        8
     2       9  10       11

In [23]:
frame4.ix['a'].ix[2].Ohio.R

4

In [28]:
frame4.Ohio.R.ix['a'].ix[2]

4

In [8]:
frame4.ix['a']

state Ohio    Colorado
color    G  R        G
key2
1        0  1        2
2        3  4        5

In [9]:
frame4.ix['a'].ix[1]

state     color
Ohio      G        0
          R        1
Colorado  G        2
Name: 1, dtype: int64

In [10]:
frame4.Ohio.G

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: G, dtype: int64

In [11]:
frame4.sortlevel(1)

state     Ohio     Colorado
color        G   R        G
key1 key2
a    1       0   1        2
b    1       6   7        8
a    2       3   4        5
b    2       9  10       11

## 상관분석
https://ko.wikipedia.org/wiki/상관분석
https://en.wikipedia.org/wiki/Correlation_and_dependence
## Excel 방식
http://blog.naver.com/PostView.nhn?blogId=foolhun3&logNo=220305763272

In [13]:
#mobile mau

In [4]:
mail_mmau = pd.read_csv('mail_mmau.csv', index_col='분 류', thousands=',')
mail_mmau

,1월-12,2월-12,3월-12,4월-12,5월-12,6월-12,7월-12,8월-12,9월-12,10월-12,...,10월-14,11월-14,12월-14,1월-15,2월-15,3월-15,4월-15,5월-15,6월-15,7월-15
분 류,,,,,,,,,,,,,,,,,,,,,
naver.com,1449426,1318779,1525272,2156043,1935512,2204992,2769000,2753605,2777274,2805178,...,2836273,2691126,2528648,2702249,2512878,2722772,3077679,3046904,3021911,2772323
daum.net,2123572,2098304,1518737,1862319,1872582,1936302,2301563,2135555,1930862,2136730,...,1547458,1624158,1674045,1682265,1478710,1826173,1596559,1599962,1490001,1419051
nate.com,802666,813850,709876,590882,494325,660309,588872,595546,633358,687766,...,369452,352956,440285,324040,299486,317636,344752,241285,254219,311185
google.com,235290,154137,146847,155477,112506,103057,138339,85904,279269,322605,...,302822,384940,382337,357034,398593,530017,340017,316486,354260,300681
Communication-Email,3910870,3663326,3325002,4070259,3787863,4197746,5009222,4807187,4539054,4863945,...,4233829,4212221,4278095,4219187,3939242,4486005,4599696,4426058,4317891,4042735

In [9]:
mmau= mail_mmau.T
mmau

분 류     naver.com  daum.net  nate.com  google.com  Communication-Email
1월-12     1449426   2123572    802666      235290              3910870
2월-12     1318779   2098304    813850      154137              3663326
3월-12     1525272   1518737    709876      146847              3325002
4월-12     2156043   1862319    590882      155477              4070259
5월-12     1935512   1872582    494325      112506              3787863
6월-12     2204992   1936302    660309      103057              4197746
7월-12     2769000   2301563    588872      138339              5009222
8월-12     2753605   2135555    595546       85904              4807187
9월-12     2777274   1930862    633358      279269              4539054
10월-12    2805178   2136730    687766      322605              4863945
11월-12    2927579   2285009    425363      261946              4905208
12월-12    3229154   2341023    638553      188018              5152947
1월-13     3433147   2570833    750651      311931              5668116
2월-13     3363516   2678861    471897      216741              5498746
3월-13     3601681   2573414    485968      464622              5718500
4월-13     3340349   2633206    598299      177120              5459805
5월-13     3213994   2046341    406282      216049              4863537
6월-13     3148210   2206243    400556      244268              4909139
7월-13     3525625   2585445    522934      266168              5614433
8월-13     3536027   2620149    474995      239347              5478252
9월-13     3522750   2151058    399272      219926              5162335
10월-13    3438653   1854696    463383      358790              4786756
11월-13    3174030   1921762    593783      272594              4795968
12월-13    2957603   1779469    486482      245083              4452032
1월-14     3082865   1869647    527502      275666              4607764
2월-14     3193251   1947752    437116      263974              4780490
3월-14     2949148   1776500    419819      297214              4477295
4월-14     3005089   1759545    459371      395442              4637152
5월-14     3122069   1712444    379448      275913              4586450
6월-14     3042333   1542448    406276      282377              4380640
7월-14     3007247   1507817    520050      249850              4446041
8월-14     2811453   1476506    346728      313819              4213859
9월-14     2487413   1536117    357084      363053              4005916
10월-14    2836273   1547458    369452      302822              4233829
11월-14    2691126   1624158    352956      384940              4212221
12월-14    2528648   1674045    440285      382337              4278095
1월-15     2702249   1682265    324040      357034              4219187
2월-15     2512878   1478710    299486      398593              3939242
3월-15     2722772   1826173    317636      530017              4486005
4월-15     3077679   1596559    344752      340017              4599696
5월-15     3046904   1599962    241285      316486              4426058
6월-15     3021911   1490001    254219      354260              4317891
7월-15     2772323   1419051    311185      300681              4042735

In [31]:
mmau.pct_change()

분 류     naver.com  daum.net  nate.com  google.com  Communication-Email
1월-12         NaN       NaN       NaN         NaN                  NaN
2월-12   -0.090137 -0.011899  0.013934   -0.344906            -0.063296
3월-12    0.156579 -0.276207 -0.127756   -0.047296            -0.092354
4월-12    0.413547  0.226229 -0.167626    0.058769             0.224137
5월-12   -0.102285  0.005511 -0.163412   -0.276382            -0.069380
6월-12    0.139229  0.034028  0.335779   -0.083987             0.108210
7월-12    0.255787  0.188638 -0.108187    0.342354             0.193312
8월-12   -0.005560 -0.072128  0.011334   -0.379033            -0.040333
9월-12    0.008596 -0.095850  0.063491    2.250943            -0.055778
10월-12   0.010047  0.106620  0.085904    0.155177             0.071577
11월-12   0.043634  0.069395 -0.381529   -0.188029             0.008483
12월-12   0.103012  0.024514  0.501195   -0.282226             0.050505
1월-13    0.063172  0.098166  0.175550    0.659049             0.099976
2월-13   -0.020282  0.042021 -0.371350   -0.305164            -0.029881
3월-13    0.070808 -0.039363  0.029818    1.143674             0.039964
4월-13   -0.072558  0.023235  0.231149   -0.618787            -0.045238
5월-13   -0.037827 -0.222871 -0.320938    0.219789            -0.109210
6월-13   -0.020468  0.078140 -0.014094    0.130614             0.009376
7월-13    0.119882  0.171877  0.305520    0.089656             0.143670
8월-13    0.002950  0.013423 -0.091673   -0.100767            -0.024256
9월-13   -0.003755 -0.179032 -0.159419   -0.081142            -0.057667
10월-13  -0.023873 -0.137775  0.160570    0.631412            -0.072754
11월-13  -0.076955  0.036160  0.281409   -0.240241             0.001924
12월-13  -0.068187 -0.074043 -0.180707   -0.100923            -0.071714
1월-14    0.042353  0.050677  0.084320    0.124786             0.034980
2월-14    0.035806  0.041775 -0.171347   -0.042414             0.037486
3월-14   -0.076443 -0.087923 -0.039571    0.125921            -0.063423
4월-14    0.018969 -0.009544  0.094212    0.330496             0.035704
5월-14    0.038927 -0.026769 -0.173984   -0.302267            -0.010934
6월-14   -0.025539 -0.099271  0.070703    0.023428            -0.044873
7월-14   -0.011533 -0.022452  0.280041   -0.115190             0.014930
8월-14   -0.065107 -0.020766 -0.333279    0.256030            -0.052222
9월-14   -0.115257  0.040373  0.029868    0.156887            -0.049347
10월-14   0.140250  0.007383  0.034636   -0.165901             0.056894
11월-14  -0.051175  0.049565 -0.044650    0.271176            -0.005104
12월-14  -0.060375  0.030716  0.247422   -0.006762             0.015639
1월-15    0.068654  0.004910 -0.264022   -0.066180            -0.013770
2월-15   -0.070079 -0.121001 -0.075775    0.116401            -0.066350
3월-15    0.083527  0.234977  0.060604    0.329720             0.138799
4월-15    0.130348 -0.125735  0.085368   -0.358479             0.025343
5월-15   -0.009999  0.002131 -0.300120   -0.069205            -0.037750
6월-15   -0.008203 -0.068727  0.053605    0.119354            -0.024439
7월-15   -0.082593 -0.047617  0.224082   -0.151242            -0.063725

In [32]:
mmau['daum.net'].cov(mmau['Communication-Email'])

164011059464.21039

In [33]:
mmau['daum.net'].corr(mmau['Communication-Email'])

0.79280894904377797

In [34]:
mmau.corr()

분 류,naver.com,daum.net,nate.com,google.com,Communication-Email
분 류,,,,,
naver.com,1.000000,0.358375,-0.381901,0.302069,0.836771
daum.net,0.358375,1.000000,0.483446,-0.290624,0.792809
nate.com,-0.381901,0.483446,1.000000,-0.548870,0.061057
google.com,0.302069,-0.290624,-0.548870,1.000000,0.059398
Communication-Email,0.836771,0.792809,0.061057,0.059398,1.000000

In [35]:
#pc mau

In [6]:
mail_pcmau = pd.read_csv('mail_pcmau.csv', index_col='분 류', thousands=',')
mail_pcmau

,9월-02,10월-02,11월-02,12월-02,1월-03,2월-03,3월-03,4월-03,5월-03,6월-03,...,10월-14,11월-14,12월-14,1월-15,2월-15,3월-15,4월-15,5월-15,6월-15,7월-15
분 류,,,,,,,,,,,,,,,,,,,,,
naver.com,1939599,1927483,2324534,2477848,2576350,2885544,3091230,3381671,3299419,3894331,...,17130578,16857636,16798943,16600515,15483087,16903873,16550268,16710362,16924774,16636861
daum.net,18169858,17430340,18684232,19103068,19090580,19338630,19854052,19252372,19254174,20410178,...,13093149,12799077,12749609,12956563,11764914,12903009,12222087,12294511,12025579,12015783
nate.com,556665,962698,1864338,3556092,5205320,5339015,5038476,4605165,4510060,4878930,...,5740949,5422418,5294178,5331004,4853505,5067788,4960576,4809377,4956443,4861113
google.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1377576,1473539,1434281,1544514,1390391,1781983,1645368,1761574,1925899,1938953
communication-mail,20712421,20044462,20998532,21393643,21419554,21347029,21992107,21800682,21889912,22951745,...,24359396,24150259,23913457,23865345,22330964,23840936,23416619,23679246,23610765,23304235

In [7]:
pcmau = mail_pcmau.T
pcmau

분 류     naver.com  daum.net  nate.com  google.com  communication-mail
9월-02     1939599  18169858    556665         NaN            20712421
10월-02    1927483  17430340    962698         NaN            20044462
11월-02    2324534  18684232   1864338         NaN            20998532
12월-02    2477848  19103068   3556092         NaN            21393643
1월-03     2576350  19090580   5205320         NaN            21419554
2월-03     2885544  19338630   5339015         NaN            21347029
3월-03     3091230  19854052   5038476         NaN            21992107
4월-03     3381671  19252372   4605165         NaN            21800682
5월-03     3299419  19254174   4510060         NaN            21889912
6월-03     3894331  20410178   4878930         NaN            22951745
7월-03     4016301  20746605   4811039         NaN            22972780
8월-03     4428060  20186228   5320048         NaN            22379283
9월-03     4231484  20284082   5544585         NaN            22265839
10월-03    4283027  20484624   5573478         NaN            22421044
11월-03    4707581  20189203   5055455         NaN            22164090
12월-03    5302335  20910876   5983831         NaN            23043746
1월-04     5679813  20984888   5654637         NaN            23176427
2월-04     5979773  21146798   5303486         NaN            23444831
3월-04     6072524  22135197   5192742         NaN            24984428
4월-04     6249485  21456262   5428641         NaN            24315064
5월-04     6602480  21911904   6454753         NaN            24754254
6월-04     7219760  22046684   7000204         NaN            24866785
7월-04     7777300  22194677   6791591         NaN            25113490
8월-04     7834622  21690226   5206727         NaN            24722110
9월-04     7739602  22391957   5380375         NaN            25953522
10월-04    8314945  22277487   5303270         NaN            25894557
11월-04    8766620  22537309   5718460         NaN            25957531
12월-04    9210256  22940698   6488637         NaN            26129305
1월-05     9770828  23228296   5782026         NaN            26380365
2월-05     9496927  22655442   5246028      292286            26130894
...           ...       ...       ...         ...                 ...
2월-13    16445049  15302367   8136763     1917456            25469465
3월-13    17218338  15282429   8026906     1833469            25733999
4월-13    17499722  15552130   7704685     1636746            25841201
5월-13    17551734  15154851   7602971     1753664            26027771
6월-13    17402594  14618680   7296313     1496933            25647848
7월-13    17358320  14644140   7381676     1556375            25335216
8월-13    16889609  14369395   7241079     1555648            24896754
9월-13    16889534  14131943   7080461     1575855            24912915
10월-13   18025278  14633468   7015064     1611232            25423032
11월-13   17712858  14117708   6757697     1336258            25261929
12월-13   17589390  14358445   6506733     1411548            25345016
1월-14    17669087  13827592   6298640     1548955            24883209
2월-14    16806799  13443259   5980735     1382737            24214828
3월-14    17179211  13890476   6148479     1473548            24699183
4월-14    16831345  13478635   5994593     1371303            24325197
5월-14    17442516  13414101   5868764     1518505            24691219
6월-14    17318585  13201836   5841759     1517366            24568020
7월-14    17396560  13292901   6035119     1476431            24703403
8월-14    17057120  13335667   5669171     1484239            24537349
9월-14    17193074  12959223   5515749     1564786            24380176
10월-14   17130578  13093149   5740949     1377576            24359396
11월-14   16857636  12799077   5422418     1473539            24150259
12월-14   16798943  12749609   5294178     1434281            23913457
1월-15    16600515  12956563   5331004     1544514            23865345
2월-15    15483087  11764914   4853505     1390391            22330964
3월-15    16903873  12903009   5067788     1781983            23840936
4월-15    16550268  12222087   4960576     1645368            23416619
5월-15    16710362  12294511   4809377     1761574            23679246
6월-15    16924774  12025579   4956443     1925899            23610765
7월-15    16636861  12015783   4861113     1938953            23304235

[155 rows x 5 columns]

# 2차과제
## 1. 각 메일 서비스별 mobile 과 pc 의 mau 상관관계를 분석(2012년 1월~)
http://wiki.daumkakao.com/pages/viewpage.action?pageId=333764026
## 2. 선형회귀 분석을 이용해 서비스별 mobile과 pc의 2015년 8월 mau 예측
10/8일 학습내용 참고: http://wiki.daumkakao.com/download/attachments/333755176/10-8.py?version=1&modificationDate=1444299050000&api=v2

목요일 까지

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

mail_pcmau = pd.read_csv('mail_pcmau.csv', index_col='분 류', thousands=',')
mail_mmau = pd.read_csv('mail_mmau.csv', index_col='분 류', thousands=',')

mmau = mail_mmau.T
pcmau = mail_pcmau.T

pd.concat({'mobile': mmau, 'PC': pcmau}, axis=1, join='inner').corr().PC.ix['mobile']

                                  PC                                 \
분 류                        naver.com  daum.net  nate.com google.com
       분 류
PC     naver.com            1.000000  0.439784  0.333719   0.040172
       daum.net             0.439784  1.000000  0.897975   0.609559
       nate.com             0.333719  0.897975  1.000000   0.687268
       google.com           0.040172  0.609559  0.687268   1.000000
       communication-mail   0.577233  0.973625  0.901100   0.597074
mobile naver.com            0.065337 -0.220610 -0.553288  -0.375898
       daum.net             0.157944  0.665910  0.437170   0.344896
       nate.com             0.311487  0.813449  0.813443   0.465158
       google.com          -0.386705 -0.662553 -0.705153  -0.397874
       Communication-Email  0.113592  0.240541 -0.107334  -0.021826

                                                 mobile                      \
분 류                        communication-mail naver.com  daum.net  nate.com
       분 류
PC     naver.com                     0.577233  0.065337  0.157944  0.311487
       daum.net                      0.973625 -0.220610  0.665910  0.813449
       nate.com                      0.901100 -0.553288  0.437170  0.813443
       google.com                    0.597074 -0.375898  0.344896  0.465158
       communication-mail            1.000000 -0.262742  0.568185  0.795905
mobile naver.com                    -0.262742  1.000000  0.358375 -0.381901
       daum.net                      0.568185  0.358375  1.000000  0.483446
       nate.com                      0.795905 -0.381901  0.483446  1.000000
       google.com                   -0.702522  0.302069 -0.290624 -0.548870
       Communication-Email           0.159496  0.836771  0.792809  0.061057


분 류                        google.com Communication-Email
       분 류
PC     naver.com            -0.386705            0.113592
       daum.net             -0.662553            0.240541
       nate.com             -0.705153           -0.107334
       google.com           -0.397874           -0.021826
       communication-mail   -0.702522            0.159496
mobile naver.com             0.302069            0.836771
       daum.net             -0.290624            0.792809
       nate.com             -0.548870            0.061057
       google.com            1.000000            0.059398
       Communication-Email   0.059398            1.000000

In [100]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

mail_pcmau = pd.read_csv('mail_pcmau.csv', index_col='분 류', thousands=',')
mail_mmau = pd.read_csv('mail_mmau.csv', index_col='분 류', thousands=',')

mmau = mail_mmau.T
pcmau = mail_pcmau.T

mmau

분 류     naver.com  daum.net  nate.com  google.com  Communication-Email
1월-12     1449426   2123572    802666      235290              3910870
2월-12     1318779   2098304    813850      154137              3663326
3월-12     1525272   1518737    709876      146847              3325002
4월-12     2156043   1862319    590882      155477              4070259
5월-12     1935512   1872582    494325      112506              3787863
6월-12     2204992   1936302    660309      103057              4197746
7월-12     2769000   2301563    588872      138339              5009222
8월-12     2753605   2135555    595546       85904              4807187
9월-12     2777274   1930862    633358      279269              4539054
10월-12    2805178   2136730    687766      322605              4863945
11월-12    2927579   2285009    425363      261946              4905208
12월-12    3229154   2341023    638553      188018              5152947
1월-13     3433147   2570833    750651      311931              5668116
2월-13     3363516   2678861    471897      216741              5498746
3월-13     3601681   2573414    485968      464622              5718500
4월-13     3340349   2633206    598299      177120              5459805
5월-13     3213994   2046341    406282      216049              4863537
6월-13     3148210   2206243    400556      244268              4909139
7월-13     3525625   2585445    522934      266168              5614433
8월-13     3536027   2620149    474995      239347              5478252
9월-13     3522750   2151058    399272      219926              5162335
10월-13    3438653   1854696    463383      358790              4786756
11월-13    3174030   1921762    593783      272594              4795968
12월-13    2957603   1779469    486482      245083              4452032
1월-14     3082865   1869647    527502      275666              4607764
2월-14     3193251   1947752    437116      263974              4780490
3월-14     2949148   1776500    419819      297214              4477295
4월-14     3005089   1759545    459371      395442              4637152
5월-14     3122069   1712444    379448      275913              4586450
6월-14     3042333   1542448    406276      282377              4380640
7월-14     3007247   1507817    520050      249850              4446041
8월-14     2811453   1476506    346728      313819              4213859
9월-14     2487413   1536117    357084      363053              4005916
10월-14    2836273   1547458    369452      302822              4233829
11월-14    2691126   1624158    352956      384940              4212221
12월-14    2528648   1674045    440285      382337              4278095
1월-15     2702249   1682265    324040      357034              4219187
2월-15     2512878   1478710    299486      398593              3939242
3월-15     2722772   1826173    317636      530017              4486005
4월-15     3077679   1596559    344752      340017              4599696
5월-15     3046904   1599962    241285      316486              4426058
6월-15     3021911   1490001    254219      354260              4317891
7월-15     2772323   1419051    311185      300681              4042735

In [265]:
from sklearn.linear_model import LinearRegression

lr = LinearRegression()

mail_pcmau = pd.read_csv('mail_pcmau.csv', index_col='분 류', thousands=',')
mail_mmau = pd.read_csv('mail_mmau.csv', index_col='분 류', thousands=',')

data = pd.concat({'mobile': mail_mmau, 'PC': mail_pcmau}, axis=0, join='inner')

data

                               1월-12     2월-12     3월-12     4월-12     5월-12  \
       분 류
PC     naver.com            17121839  16950102  17123838  17756425  17845347
       daum.net             16228608  15748261  15950497  15967961  16488893
       nate.com             12271546  11773522  11649994  11917413  11838747
       google.com            2031192   2023086   1891066   1989751   1953428
       communication-mail   26844061  26324191  26440470  27000678  27110680
mobile naver.com             1449426   1318779   1525272   2156043   1935512
       daum.net              2123572   2098304   1518737   1862319   1872582
       nate.com               802666    813850    709876    590882    494325
       google.com             235290    154137    146847    155477    112506
       Communication-Email   3910870   3663326   3325002   4070259   3787863

                               6월-12     7월-12     8월-12     9월-12    10월-12  \
       분 류
PC     naver.com            17138097  17276779  17599890  16685681  16754910
       daum.net             15572506  16291615  16564825  15481871  16125494
       nate.com             10768330   9908393   9222417   8553294   8685570
       google.com            1921062   2065869   1878269   1830855   1851246
       communication-mail   26197903  26994676  26958452  26106865  26055860
mobile naver.com             2204992   2769000   2753605   2777274   2805178
       daum.net              1936302   2301563   2135555   1930862   2136730
       nate.com               660309    588872    595546    633358    687766
       google.com             103057    138339     85904    279269    322605
       Communication-Email   4197746   5009222   4807187   4539054   4863945

                              ...       10월-14    11월-14    12월-14     1월-15  \
       분 류                    ...
PC     naver.com              ...     17130578  16857636  16798943  16600515
       daum.net               ...     13093149  12799077  12749609  12956563
       nate.com               ...      5740949   5422418   5294178   5331004
       google.com             ...      1377576   1473539   1434281   1544514
       communication-mail     ...     24359396  24150259  23913457  23865345
mobile naver.com              ...      2836273   2691126   2528648   2702249
       daum.net               ...      1547458   1624158   1674045   1682265
       nate.com               ...       369452    352956    440285    324040
       google.com             ...       302822    384940    382337    357034
       Communication-Email    ...      4233829   4212221   4278095   4219187

                               2월-15     3월-15     4월-15     5월-15     6월-15  \
       분 류
PC     naver.com            15483087  16903873  16550268  16710362  16924774
       daum.net             11764914  12903009  12222087  12294511  12025579
       nate.com              4853505   5067788   4960576   4809377   4956443
       google.com            1390391   1781983   1645368   1761574   1925899
       communication-mail   22330964  23840936  23416619  23679246  23610765
mobile naver.com             2512878   2722772   3077679   3046904   3021911
       daum.net              1478710   1826173   1596559   1599962   1490001
       nate.com               299486    317636    344752    241285    254219
       google.com             398593    530017    340017    316486    354260
       Communication-Email   3939242   4486005   4599696   4426058   4317891

                               7월-15
       분 류
PC     naver.com            16636861
       daum.net             12015783
       nate.com              4861113
       google.com            1938953
       communication-mail   23304235
mobile naver.com             2772323
       daum.net              1419051
       nate.com               311185
       google.com             300681
       Communication-Email   4042735

[10 rows x 43 columns]

In [267]:
#y = mmau['naver.com'].values
y = data['1월-12']
print(y)

#print("y:", y)
print(y.shape)

#X = mail_pcmau[:,1:]
X = data
#X

print(X.shape)
#mail_pcmau


#X
#data

#y = pd.DataFrame(data, columns=['daum.net']).values

#y = pd.DataFrame(data, columns=['daum.net', 'nate.com', 'google.com', 'Communication-Email']).values
#y

model = lr.fit(X, y)

print("model.coef_:", model.coef_)
model.predict(X)

        분 류
PC      naver.com              17121839
        daum.net               16228608
        nate.com               12271546
        google.com              2031192
        communication-mail     26844061
mobile  naver.com               1449426
        daum.net                2123572
        nate.com                 802666
        google.com               235290
        Communication-Email     3910870
Name: 1월-12, dtype: int64
(10,)
(10, 43)
model.coef_: [  3.12570343e-01   2.76242319e-01   1.31119430e-01   1.36104476e-01
   7.43133506e-02   1.21563150e-01   7.60535827e-02  -6.43575460e-03
  -7.55555608e-03   3.08685047e-02  -9.01901647e-03  -3.71564142e-02
   3.84995281e-02  -2.85248815e-03   5.27330096e-02   4.50303085e-05
  -7.97518121e-02  -3.24205908e-03   5.72330747e-02   5.95520511e-03
  -4.95378868e-02  -1.16471651e-01   1.34740093e-02  -5.23294990e-02
  -3.38716175e-02  -1.46491225e-02  -3.27346377e-02   4.40859935e-02
  -3.34056392e-02  -4.39059949e-02  -3.71825472e-03  -2.46102631e-02
   4.11816827e-02  -4.69590320e-03   4.34884040e-02   1.16583956e-01
   1.38227011e-03   5.03829274e-02   7.25560798e-02   2.05535703e-02
  -4.63924324e-02  -4.53224041e-02  -6.06515341e-02]

array([ 17121839.00000014,  16228608.00000009,  12271545.99999999,
         2031191.99999991,  26844061.00000029,   1449425.99999993,
         2123571.99999991,    802665.99999989,    235289.99999989,
         3910869.99999995])

In [268]:
print("shape:", model.predict(X).shape)

# 모델의 정확도 평가. 1 이 perfect
print("모델의 정확도 평가: ", model.score(X,y))

# 모델의 정확도 평가. 분산값. 클수록 정확도가 나쁜 모델
print("모델의 정확도 평가. 분산값. 클수록 정확도가 나쁜 모델: ", (np.mean((model.predict(X) - y) ** 2)))

shape: (10,)
모델의 정확도 평가:  1.0
모델의 정확도 평가. 분산값. 클수록 정확도가 나쁜 모델:  1.6058314973e-14